       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       PROCEDURE DIVISION.
           DISPLAY 'modified HELLOWORLD pgm to copy to PDS from VScode'
           STOP RUN.
