       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       PROCEDURE DIVISION.
           DISPLAY 'modified the HELLO WORLD to copy to PDS from VScode'
           STOP RUN.
