       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       PROCEDURE DIVISION.
           DISPLAY 'modified the HELLO WORLD to detect the change-6'.
           STOP RUN.
